tutorials/GalluimCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       25770;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       25870;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          130;
        startFace       25970;
    }
    top
    {
        type            patch;
        nFaces          130;
        startFace       26100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          26000;
        startFace       26230;
    }
)

// ************************************************************************* //
