tutorials/GalluimCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);

phase1
{
    transportModel  Newtonian;
    nu              2.967e-07;
    rho             6100;
    cp  381.0;//500;
    kappa  32.0; 
    Tsolidus    302;//Fusion temperature is 302.78
    Tliquidus   303;
    LatentHeat  8.016e4;//270000;
    beta    1.2e-4;
}

phase2
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    cp  1000;
    kappa  1.0;
    Tsolidus    1.0;
    Tliquidus   10.0;
    LatentHeat  1.0;
    beta    5.0e-4;
}

sigma            1.5;
dsigmadT	-2e-4;

// ************************************************************************* //
